---
kind: other
id: Methods.T:Autodesk.Revit.DB.Location
source: html/e8414fee-96a6-4e63-77e7-48edcfb8adaf.htm
---
# Location Methods

Causes the object to release immediately any resources it may be utilizing.